In [7]:
import pandas as pd

list1= [1,2,3,4,5,6,7,8,8]
ds= pd.Series(list1)
ds

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    8
dtype: int64

In [5]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

In [6]:
d

{'Name': 0      Tom
 1    James
 2    Ricky
 3      Vin
 4    Steve
 5    Smith
 6     Jack
 dtype: object, 'Age': 0    25
 1    26
 2    25
 3    23
 4    30
 5    29
 6    23
 dtype: int64, 'Rating': 0    4.23
 1    3.24
 2    3.98
 3    2.56
 4    3.20
 5    4.60
 6    3.80
 dtype: float64}

In [11]:
df = pd.DataFrame(d)
df

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [22]:
#renaming columns
df.rename(columns={'Name':'User'})

    User  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [27]:
#renaming indexs
df.rename(index={0:'a',1:'b'})

    Name  Age  Rating
a    Tom   25    4.23
b  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [33]:
#slicing
sub = df[1:3]

In [34]:
sub

    Name  Age  Rating
1  James   26    3.24
2  Ricky   25    3.98

In [43]:
#slicing
df.loc[:2:]

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98